virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/**
 * \brief Component description for SLCD
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-11-19T06:59:39Z */
#ifndef _SAML22_SLCD_COMPONENT_H_
#define _SAML22_SLCD_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SLCD                                         */
/* ************************************************************************** */

/* -------- SLCD_CTRLA : (SLCD Offset: 0x00) (R/W 32) Control A -------- */
#define SLCD_CTRLA_RESETVALUE                 _U_(0x3D80000)                                       /**<  (SLCD_CTRLA) Control A  Reset Value */

#define SLCD_CTRLA_SWRST_Pos                  _U_(0)                                               /**< (SLCD_CTRLA) Software Reset Position */
#define SLCD_CTRLA_SWRST_Msk                  (_U_(0x1) << SLCD_CTRLA_SWRST_Pos)                   /**< (SLCD_CTRLA) Software Reset Mask */
#define SLCD_CTRLA_SWRST(value)               (SLCD_CTRLA_SWRST_Msk & ((value) << SLCD_CTRLA_SWRST_Pos))
#define SLCD_CTRLA_ENABLE_Pos                 _U_(1)                                               /**< (SLCD_CTRLA) Enable Position */
#define SLCD_CTRLA_ENABLE_Msk                 (_U_(0x1) << SLCD_CTRLA_ENABLE_Pos)                  /**< (SLCD_CTRLA) Enable Mask */
#define SLCD_CTRLA_ENABLE(value)              (SLCD_CTRLA_ENABLE_Msk & ((value) << SLCD_CTRLA_ENABLE_Pos))
#define SLCD_CTRLA_DUTY_Pos                   _U_(2)                                               /**< (SLCD_CTRLA) Duty Ratio Position */
#define SLCD_CTRLA_DUTY_Msk                   (_U_(0x7) << SLCD_CTRLA_DUTY_Pos)                    /**< (SLCD_CTRLA) Duty Ratio Mask */
#define SLCD_CTRLA_DUTY(value)                (SLCD_CTRLA_DUTY_Msk & ((value) << SLCD_CTRLA_DUTY_Pos))
#define   SLCD_CTRLA_DUTY_HALF_Val            _U_(0x1)                                             /**< (SLCD_CTRLA) 1/2 duty  */
#define   SLCD_CTRLA_DUTY_THIRD_Val           _U_(0x2)                                             /**< (SLCD_CTRLA) 1/3 duty  */
#define   SLCD_CTRLA_DUTY_FOURTH_Val          _U_(0x3)                                             /**< (SLCD_CTRLA) 1/4 duty  */
#define   SLCD_CTRLA_DUTY_SIXTH_Val           _U_(0x4)                                             /**< (SLCD_CTRLA) 1/6 duty  */
#define   SLCD_CTRLA_DUTY_EIGHT_Val           _U_(0x5)                                             /**< (SLCD_CTRLA) 1/8 duty  */
#define SLCD_CTRLA_DUTY_HALF                  (SLCD_CTRLA_DUTY_HALF_Val << SLCD_CTRLA_DUTY_Pos)    /**< (SLCD_CTRLA) 1/2 duty Position  */
#define SLCD_CTRLA_DUTY_THIRD                 (SLCD_CTRLA_DUTY_THIRD_Val << SLCD_CTRLA_DUTY_Pos)   /**< (SLCD_CTRLA) 1/3 duty Position  */
#define SLCD_CTRLA_DUTY_FOURTH                (SLCD_CTRLA_DUTY_FOURTH_Val << SLCD_CTRLA_DUTY_Pos)  /**< (SLCD_CTRLA) 1/4 duty Position  */
#define SLCD_CTRLA_DUTY_SIXTH                 (SLCD_CTRLA_DUTY_SIXTH_Val << SLCD_CTRLA_DUTY_Pos)   /**< (SLCD_CTRLA) 1/6 duty Position  */
#define SLCD_CTRLA_DUTY_EIGHT                 (SLCD_CTRLA_DUTY_EIGHT_Val << SLCD_CTRLA_DUTY_Pos)   /**< (SLCD_CTRLA) 1/8 duty Position  */
#define SLCD_CTRLA_WMOD_Pos                   _U_(5)                                               /**< (SLCD_CTRLA) Waveform Mode Position */
#define SLCD_CTRLA_WMOD_Msk                   (_U_(0x1) << SLCD_CTRLA_WMOD_Pos)                    /**< (SLCD_CTRLA) Waveform Mode Mask */
#define SLCD_CTRLA_WMOD(value)                (SLCD_CTRLA_WMOD_Msk & ((value) << SLCD_CTRLA_WMOD_Pos))
#define   SLCD_CTRLA_WMOD_LP_Val              _U_(0x0)                                             /**< (SLCD_CTRLA) Low Power Waveform Mode  */
#define   SLCD_CTRLA_WMOD_STD_Val             _U_(0x1)                                             /**< (SLCD_CTRLA) Standard Waveform Mode  */
#define SLCD_CTRLA_WMOD_LP                    (SLCD_CTRLA_WMOD_LP_Val << SLCD_CTRLA_WMOD_Pos)      /**< (SLCD_CTRLA) Low Power Waveform Mode Position  */
#define SLCD_CTRLA_WMOD_STD                   (SLCD_CTRLA_WMOD_STD_Val << SLCD_CTRLA_WMOD_Pos)     /**< (SLCD_CTRLA) Standard Waveform Mode Position  */
#define SLCD_CTRLA_RUNSTDBY_Pos               _U_(6)                                               /**< (SLCD_CTRLA) Run in Standby Position */
#define SLCD_CTRLA_RUNSTDBY_Msk               (_U_(0x1) << SLCD_CTRLA_RUNSTDBY_Pos)                /**< (SLCD_CTRLA) Run in Standby Mask */
#define SLCD_CTRLA_RUNSTDBY(value)            (SLCD_CTRLA_RUNSTDBY_Msk & ((value) << SLCD_CTRLA_RUNSTDBY_Pos))
#define SLCD_CTRLA_PRESC_Pos                  _U_(8)                                               /**< (SLCD_CTRLA) Clock Prescaler Position */
#define SLCD_CTRLA_PRESC_Msk                  (_U_(0x3) << SLCD_CTRLA_PRESC_Pos)                   /**< (SLCD_CTRLA) Clock Prescaler Mask */
#define SLCD_CTRLA_PRESC(value)               (SLCD_CTRLA_PRESC_Msk & ((value) << SLCD_CTRLA_PRESC_Pos))
#define   SLCD_CTRLA_PRESC_PRESC16_Val        _U_(0x0)                                             /**< (SLCD_CTRLA) 16  */
#define   SLCD_CTRLA_PRESC_PRESC32_Val        _U_(0x1)                                             /**< (SLCD_CTRLA) 32  */
#define   SLCD_CTRLA_PRESC_PRESC64_Val        _U_(0x2)                                             /**< (SLCD_CTRLA) 64  */
#define   SLCD_CTRLA_PRESC_PRESC128_Val       _U_(0x3)                                             /**< (SLCD_CTRLA) 128  */
#define SLCD_CTRLA_PRESC_PRESC16              (SLCD_CTRLA_PRESC_PRESC16_Val << SLCD_CTRLA_PRESC_Pos) /**< (SLCD_CTRLA) 16 Position  */
#define SLCD_CTRLA_PRESC_PRESC32              (SLCD_CTRLA_PRESC_PRESC32_Val << SLCD_CTRLA_PRESC_Pos) /**< (SLCD_CTRLA) 32 Position  */
#define SLCD_CTRLA_PRESC_PRESC64              (SLCD_CTRLA_PRESC_PRESC64_Val << SLCD_CTRLA_PRESC_Pos) /**< (SLCD_CTRLA) 64 Position  */
#define SLCD_CTRLA_PRESC_PRESC128             (SLCD_CTRLA_PRESC_PRESC128_Val << SLCD_CTRLA_PRESC_Pos) /**< (SLCD_CTRLA) 128 Position  */
#define SLCD_CTRLA_CKDIV_Pos                  _U_(12)                                              /**< (SLCD_CTRLA) Clock Divider Position */
#define SLCD_CTRLA_CKDIV_Msk                  (_U_(0x7) << SLCD_CTRLA_CKDIV_Pos)                   /**< (SLCD_CTRLA) Clock Divider Mask */
#define SLCD_CTRLA_CKDIV(value)               (SLCD_CTRLA_CKDIV_Msk & ((value) << SLCD_CTRLA_CKDIV_Pos))
#define SLCD_CTRLA_BIAS_Pos                   _U_(16)                                              /**< (SLCD_CTRLA) Bias Setting Position */
#define SLCD_CTRLA_BIAS_Msk                   (_U_(0x3) << SLCD_CTRLA_BIAS_Pos)                    /**< (SLCD_CTRLA) Bias Setting Mask */
#define SLCD_CTRLA_BIAS(value)                (SLCD_CTRLA_BIAS_Msk & ((value) << SLCD_CTRLA_BIAS_Pos))
#define   SLCD_CTRLA_BIAS_HALF_Val            _U_(0x1)                                             /**< (SLCD_CTRLA) 1/2 bias  */
#define   SLCD_CTRLA_BIAS_THIRD_Val           _U_(0x2)                                             /**< (SLCD_CTRLA) 1/3 bias  */
#define   SLCD_CTRLA_BIAS_FOURTH_Val          _U_(0x3)                                             /**< (SLCD_CTRLA) 1/4 bias  */
#define SLCD_CTRLA_BIAS_HALF                  (SLCD_CTRLA_BIAS_HALF_Val << SLCD_CTRLA_BIAS_Pos)    /**< (SLCD_CTRLA) 1/2 bias Position  */
#define SLCD_CTRLA_BIAS_THIRD                 (SLCD_CTRLA_BIAS_THIRD_Val << SLCD_CTRLA_BIAS_Pos)   /**< (SLCD_CTRLA) 1/3 bias Position  */
#define SLCD_CTRLA_BIAS_FOURTH                (SLCD_CTRLA_BIAS_FOURTH_Val << SLCD_CTRLA_BIAS_Pos)  /**< (SLCD_CTRLA) 1/4 bias Position  */
#define SLCD_CTRLA_XVLCD_Pos                  _U_(19)                                              /**< (SLCD_CTRLA) External VLCD Position */
#define SLCD_CTRLA_XVLCD_Msk                  (_U_(0x1) << SLCD_CTRLA_XVLCD_Pos)                   /**< (SLCD_CTRLA) External VLCD Mask */
#define SLCD_CTRLA_XVLCD(value)               (SLCD_CTRLA_XVLCD_Msk & ((value) << SLCD_CTRLA_XVLCD_Pos))
#define SLCD_CTRLA_PRF_Pos                    _U_(20)                                              /**< (SLCD_CTRLA) Power Refresh Frequency Position */
#define SLCD_CTRLA_PRF_Msk                    (_U_(0x3) << SLCD_CTRLA_PRF_Pos)                     /**< (SLCD_CTRLA) Power Refresh Frequency Mask */
#define SLCD_CTRLA_PRF(value)                 (SLCD_CTRLA_PRF_Msk & ((value) << SLCD_CTRLA_PRF_Pos))
#define   SLCD_CTRLA_PRF_PR2000_Val           _U_(0x0)                                             /**< (SLCD_CTRLA) 2kHz  */
#define   SLCD_CTRLA_PRF_PR1000_Val           _U_(0x1)                                             /**< (SLCD_CTRLA) 1kHz  */
#define   SLCD_CTRLA_PRF_PR500_Val            _U_(0x2)                                             /**< (SLCD_CTRLA) 500Hz  */
#define   SLCD_CTRLA_PRF_PR250_Val            _U_(0x3)                                             /**< (SLCD_CTRLA) 250Hz  */
#define SLCD_CTRLA_PRF_PR2000                 (SLCD_CTRLA_PRF_PR2000_Val << SLCD_CTRLA_PRF_Pos)    /**< (SLCD_CTRLA) 2kHz Position  */
#define SLCD_CTRLA_PRF_PR1000                 (SLCD_CTRLA_PRF_PR1000_Val << SLCD_CTRLA_PRF_Pos)    /**< (SLCD_CTRLA) 1kHz Position  */
#define SLCD_CTRLA_PRF_PR500                  (SLCD_CTRLA_PRF_PR500_Val << SLCD_CTRLA_PRF_Pos)     /**< (SLCD_CTRLA) 500Hz Position  */
#define SLCD_CTRLA_PRF_PR250                  (SLCD_CTRLA_PRF_PR250_Val << SLCD_CTRLA_PRF_Pos)     /**< (SLCD_CTRLA) 250Hz Position  */
#define SLCD_CTRLA_DMFCS_Pos                  _U_(22)                                              /**< (SLCD_CTRLA) Display Memory Update Frame Counter Selection Position */
#define SLCD_CTRLA_DMFCS_Msk                  (_U_(0x3) << SLCD_CTRLA_DMFCS_Pos)                   /**< (SLCD_CTRLA) Display Memory Update Frame Counter Selection Mask */
#define SLCD_CTRLA_DMFCS(value)               (SLCD_CTRLA_DMFCS_Msk & ((value) << SLCD_CTRLA_DMFCS_Pos))
#define   SLCD_CTRLA_DMFCS_FC0_Val            _U_(0x0)                                             /**< (SLCD_CTRLA) Frame Counter 0  */
#define   SLCD_CTRLA_DMFCS_FC1_Val            _U_(0x1)                                             /**< (SLCD_CTRLA) Frame Counter 1  */
#define   SLCD_CTRLA_DMFCS_FC2_Val            _U_(0x2)                                             /**< (SLCD_CTRLA) Frame Counter 2  */
#define   SLCD_CTRLA_DMFCS_NFC_Val            _U_(0x3)                                             /**< (SLCD_CTRLA) Frame Counter event to DMU is forced to 0  */
#define SLCD_CTRLA_DMFCS_FC0                  (SLCD_CTRLA_DMFCS_FC0_Val << SLCD_CTRLA_DMFCS_Pos)   /**< (SLCD_CTRLA) Frame Counter 0 Position  */
#define SLCD_CTRLA_DMFCS_FC1                  (SLCD_CTRLA_DMFCS_FC1_Val << SLCD_CTRLA_DMFCS_Pos)   /**< (SLCD_CTRLA) Frame Counter 1 Position  */
#define SLCD_CTRLA_DMFCS_FC2                  (SLCD_CTRLA_DMFCS_FC2_Val << SLCD_CTRLA_DMFCS_Pos)   /**< (SLCD_CTRLA) Frame Counter 2 Position  */
#define SLCD_CTRLA_DMFCS_NFC                  (SLCD_CTRLA_DMFCS_NFC_Val << SLCD_CTRLA_DMFCS_Pos)   /**< (SLCD_CTRLA) Frame Counter event to DMU is forced to 0 Position  */
#define SLCD_CTRLA_RRF_Pos                    _U_(24)                                              /**< (SLCD_CTRLA) Reference Refresh Frequency Position */
#define SLCD_CTRLA_RRF_Msk                    (_U_(0x7) << SLCD_CTRLA_RRF_Pos)                     /**< (SLCD_CTRLA) Reference Refresh Frequency Mask */
#define SLCD_CTRLA_RRF(value)                 (SLCD_CTRLA_RRF_Msk & ((value) << SLCD_CTRLA_RRF_Pos))
#define   SLCD_CTRLA_RRF_RR2000_Val           _U_(0x0)                                             /**< (SLCD_CTRLA) 2kHz  */
#define   SLCD_CTRLA_RRF_RR1000_Val           _U_(0x1)                                             /**< (SLCD_CTRLA) 1kHz  */
#define   SLCD_CTRLA_RRF_RR500_Val            _U_(0x2)                                             /**< (SLCD_CTRLA) 500Hz  */
#define   SLCD_CTRLA_RRF_RR250_Val            _U_(0x3)                                             /**< (SLCD_CTRLA) 250Hz  */
#define   SLCD_CTRLA_RRF_RR125_Val            _U_(0x4)                                             /**< (SLCD_CTRLA) 125Hz  */
#define   SLCD_CTRLA_RRF_RR62_Val             _U_(0x5)                                             /**< (SLCD_CTRLA) 62.5Hz  */
#define SLCD_CTRLA_RRF_RR2000                 (SLCD_CTRLA_RRF_RR2000_Val << SLCD_CTRLA_RRF_Pos)    /**< (SLCD_CTRLA) 2kHz Position  */
#define SLCD_CTRLA_RRF_RR1000                 (SLCD_CTRLA_RRF_RR1000_Val << SLCD_CTRLA_RRF_Pos)    /**< (SLCD_CTRLA) 1kHz Position  */
#define SLCD_CTRLA_RRF_RR500                  (SLCD_CTRLA_RRF_RR500_Val << SLCD_CTRLA_RRF_Pos)     /**< (SLCD_CTRLA) 500Hz Position  */
#define SLCD_CTRLA_RRF_RR250                  (SLCD_CTRLA_RRF_RR250_Val << SLCD_CTRLA_RRF_Pos)     /**< (SLCD_CTRLA) 250Hz Position  */
#define SLCD_CTRLA_RRF_RR125                  (SLCD_CTRLA_RRF_RR125_Val << SLCD_CTRLA_RRF_Pos)     /**< (SLCD_CTRLA) 125Hz Position  */
#define SLCD_CTRLA_RRF_RR62                   (SLCD_CTRLA_RRF_RR62_Val << SLCD_CTRLA_RRF_Pos)      /**< (SLCD_CTRLA) 62.5Hz Position  */
#define SLCD_CTRLA_Msk                        _U_(0x07FB737F)                                      /**< (SLCD_CTRLA) Register Mask  */


/* -------- SLCD_CTRLB : (SLCD Offset: 0x04) (R/W 16) Control B -------- */
#define SLCD_CTRLB_RESETVALUE                 _U_(0x00)                                            /**<  (SLCD_CTRLB) Control B  Reset Value */

#define SLCD_CTRLB_BBD_Pos                    _U_(0)                                               /**< (SLCD_CTRLB) Bias Buffer Enable Duration Position */
#define SLCD_CTRLB_BBD_Msk                    (_U_(0xF) << SLCD_CTRLB_BBD_Pos)                     /**< (SLCD_CTRLB) Bias Buffer Enable Duration Mask */
#define SLCD_CTRLB_BBD(value)                 (SLCD_CTRLB_BBD_Msk & ((value) << SLCD_CTRLB_BBD_Pos))
#define SLCD_CTRLB_BBEN_Pos                   _U_(7)                                               /**< (SLCD_CTRLB) Bias Buffer Enable Position */
#define SLCD_CTRLB_BBEN_Msk                   (_U_(0x1) << SLCD_CTRLB_BBEN_Pos)                    /**< (SLCD_CTRLB) Bias Buffer Enable Mask */
#define SLCD_CTRLB_BBEN(value)                (SLCD_CTRLB_BBEN_Msk & ((value) << SLCD_CTRLB_BBEN_Pos))
#define SLCD_CTRLB_LRD_Pos                    _U_(8)                                               /**< (SLCD_CTRLB) Low Resistance Enable Duration Position */
#define SLCD_CTRLB_LRD_Msk                    (_U_(0xF) << SLCD_CTRLB_LRD_Pos)                     /**< (SLCD_CTRLB) Low Resistance Enable Duration Mask */
#define SLCD_CTRLB_LRD(value)                 (SLCD_CTRLB_LRD_Msk & ((value) << SLCD_CTRLB_LRD_Pos))
#define SLCD_CTRLB_LREN_Pos                   _U_(15)                                              /**< (SLCD_CTRLB) Low Resistance Enable Position */
#define SLCD_CTRLB_LREN_Msk                   (_U_(0x1) << SLCD_CTRLB_LREN_Pos)                    /**< (SLCD_CTRLB) Low Resistance Enable Mask */
#define SLCD_CTRLB_LREN(value)                (SLCD_CTRLB_LREN_Msk & ((value) << SLCD_CTRLB_LREN_Pos))
#define SLCD_CTRLB_Msk                        _U_(0x8F8F)                                          /**< (SLCD_CTRLB) Register Mask  */


/* -------- SLCD_CTRLC : (SLCD Offset: 0x06) (R/W 16) Control C -------- */
#define SLCD_CTRLC_RESETVALUE                 _U_(0x00)                                            /**<  (SLCD_CTRLC) Control C  Reset Value */

