virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
#define SLCD_CTRLC_CLEAR_Pos                  _U_(0)                                               /**< (SLCD_CTRLC) Clear Display Memory Position */
#define SLCD_CTRLC_CLEAR_Msk                  (_U_(0x1) << SLCD_CTRLC_CLEAR_Pos)                   /**< (SLCD_CTRLC) Clear Display Memory Mask */
#define SLCD_CTRLC_CLEAR(value)               (SLCD_CTRLC_CLEAR_Msk & ((value) << SLCD_CTRLC_CLEAR_Pos))
#define SLCD_CTRLC_LOCK_Pos                   _U_(1)                                               /**< (SLCD_CTRLC) Lock Shadow Memory Position */
#define SLCD_CTRLC_LOCK_Msk                   (_U_(0x1) << SLCD_CTRLC_LOCK_Pos)                    /**< (SLCD_CTRLC) Lock Shadow Memory Mask */
#define SLCD_CTRLC_LOCK(value)                (SLCD_CTRLC_LOCK_Msk & ((value) << SLCD_CTRLC_LOCK_Pos))
#define SLCD_CTRLC_ABMEN_Pos                  _U_(2)                                               /**< (SLCD_CTRLC) Automated Bit Mapping Enable Position */
#define SLCD_CTRLC_ABMEN_Msk                  (_U_(0x1) << SLCD_CTRLC_ABMEN_Pos)                   /**< (SLCD_CTRLC) Automated Bit Mapping Enable Mask */
#define SLCD_CTRLC_ABMEN(value)               (SLCD_CTRLC_ABMEN_Msk & ((value) << SLCD_CTRLC_ABMEN_Pos))
#define SLCD_CTRLC_ACMEN_Pos                  _U_(3)                                               /**< (SLCD_CTRLC) Automated Character Mapping Enable Position */
#define SLCD_CTRLC_ACMEN_Msk                  (_U_(0x1) << SLCD_CTRLC_ACMEN_Pos)                   /**< (SLCD_CTRLC) Automated Character Mapping Enable Mask */
#define SLCD_CTRLC_ACMEN(value)               (SLCD_CTRLC_ACMEN_Msk & ((value) << SLCD_CTRLC_ACMEN_Pos))
#define SLCD_CTRLC_CTST_Pos                   _U_(4)                                               /**< (SLCD_CTRLC) Contrast Adjustment Position */
#define SLCD_CTRLC_CTST_Msk                   (_U_(0xF) << SLCD_CTRLC_CTST_Pos)                    /**< (SLCD_CTRLC) Contrast Adjustment Mask */
#define SLCD_CTRLC_CTST(value)                (SLCD_CTRLC_CTST_Msk & ((value) << SLCD_CTRLC_CTST_Pos))
#define SLCD_CTRLC_LPPM_Pos                   _U_(8)                                               /**< (SLCD_CTRLC) LCD Power Macro Power mode Position */
#define SLCD_CTRLC_LPPM_Msk                   (_U_(0x3) << SLCD_CTRLC_LPPM_Pos)                    /**< (SLCD_CTRLC) LCD Power Macro Power mode Mask */
#define SLCD_CTRLC_LPPM(value)                (SLCD_CTRLC_LPPM_Msk & ((value) << SLCD_CTRLC_LPPM_Pos))
#define   SLCD_CTRLC_LPPM_AUTO_Val            _U_(0x0)                                             /**< (SLCD_CTRLC) LCD power automatically select regualation mode or pump mode  */
#define   SLCD_CTRLC_LPPM_STEPUP_Val          _U_(0x1)                                             /**< (SLCD_CTRLC) LCD power use step-up pump loop only  */
#define   SLCD_CTRLC_LPPM_STEPDOWN_Val        _U_(0x2)                                             /**< (SLCD_CTRLC) LCD power use step-down drop-out regulation loop only  */
#define SLCD_CTRLC_LPPM_AUTO                  (SLCD_CTRLC_LPPM_AUTO_Val << SLCD_CTRLC_LPPM_Pos)    /**< (SLCD_CTRLC) LCD power automatically select regualation mode or pump mode Position  */
#define SLCD_CTRLC_LPPM_STEPUP                (SLCD_CTRLC_LPPM_STEPUP_Val << SLCD_CTRLC_LPPM_Pos)  /**< (SLCD_CTRLC) LCD power use step-up pump loop only Position  */
#define SLCD_CTRLC_LPPM_STEPDOWN              (SLCD_CTRLC_LPPM_STEPDOWN_Val << SLCD_CTRLC_LPPM_Pos) /**< (SLCD_CTRLC) LCD power use step-down drop-out regulation loop only Position  */
#define SLCD_CTRLC_Msk                        _U_(0x03FF)                                          /**< (SLCD_CTRLC) Register Mask  */


/* -------- SLCD_CTRLD : (SLCD Offset: 0x08) (R/W 8) Control D -------- */
#define SLCD_CTRLD_RESETVALUE                 _U_(0x80)                                            /**<  (SLCD_CTRLD) Control D  Reset Value */

#define SLCD_CTRLD_BLANK_Pos                  _U_(0)                                               /**< (SLCD_CTRLD) Blank LCD Position */
#define SLCD_CTRLD_BLANK_Msk                  (_U_(0x1) << SLCD_CTRLD_BLANK_Pos)                   /**< (SLCD_CTRLD) Blank LCD Mask */
#define SLCD_CTRLD_BLANK(value)               (SLCD_CTRLD_BLANK_Msk & ((value) << SLCD_CTRLD_BLANK_Pos))
#define SLCD_CTRLD_BLINK_Pos                  _U_(1)                                               /**< (SLCD_CTRLD) Blinking Enable Position */
#define SLCD_CTRLD_BLINK_Msk                  (_U_(0x1) << SLCD_CTRLD_BLINK_Pos)                   /**< (SLCD_CTRLD) Blinking Enable Mask */
#define SLCD_CTRLD_BLINK(value)               (SLCD_CTRLD_BLINK_Msk & ((value) << SLCD_CTRLD_BLINK_Pos))
#define SLCD_CTRLD_CSREN_Pos                  _U_(2)                                               /**< (SLCD_CTRLD) Circular Shift Register Enable Position */
#define SLCD_CTRLD_CSREN_Msk                  (_U_(0x1) << SLCD_CTRLD_CSREN_Pos)                   /**< (SLCD_CTRLD) Circular Shift Register Enable Mask */
#define SLCD_CTRLD_CSREN(value)               (SLCD_CTRLD_CSREN_Msk & ((value) << SLCD_CTRLD_CSREN_Pos))
#define SLCD_CTRLD_FC0EN_Pos                  _U_(4)                                               /**< (SLCD_CTRLD) Frame Counter 0 Enable Position */
#define SLCD_CTRLD_FC0EN_Msk                  (_U_(0x1) << SLCD_CTRLD_FC0EN_Pos)                   /**< (SLCD_CTRLD) Frame Counter 0 Enable Mask */
#define SLCD_CTRLD_FC0EN(value)               (SLCD_CTRLD_FC0EN_Msk & ((value) << SLCD_CTRLD_FC0EN_Pos))
#define SLCD_CTRLD_FC1EN_Pos                  _U_(5)                                               /**< (SLCD_CTRLD) Frame Counter 1 Enable Position */
#define SLCD_CTRLD_FC1EN_Msk                  (_U_(0x1) << SLCD_CTRLD_FC1EN_Pos)                   /**< (SLCD_CTRLD) Frame Counter 1 Enable Mask */
#define SLCD_CTRLD_FC1EN(value)               (SLCD_CTRLD_FC1EN_Msk & ((value) << SLCD_CTRLD_FC1EN_Pos))
#define SLCD_CTRLD_FC2EN_Pos                  _U_(6)                                               /**< (SLCD_CTRLD) Frame Counter 2 Enable Position */
#define SLCD_CTRLD_FC2EN_Msk                  (_U_(0x1) << SLCD_CTRLD_FC2EN_Pos)                   /**< (SLCD_CTRLD) Frame Counter 2 Enable Mask */
#define SLCD_CTRLD_FC2EN(value)               (SLCD_CTRLD_FC2EN_Msk & ((value) << SLCD_CTRLD_FC2EN_Pos))
#define SLCD_CTRLD_DISPEN_Pos                 _U_(7)                                               /**< (SLCD_CTRLD) Display enable Position */
#define SLCD_CTRLD_DISPEN_Msk                 (_U_(0x1) << SLCD_CTRLD_DISPEN_Pos)                  /**< (SLCD_CTRLD) Display enable Mask */
#define SLCD_CTRLD_DISPEN(value)              (SLCD_CTRLD_DISPEN_Msk & ((value) << SLCD_CTRLD_DISPEN_Pos))
#define SLCD_CTRLD_Msk                        _U_(0xF7)                                            /**< (SLCD_CTRLD) Register Mask  */


/* -------- SLCD_EVCTRL : (SLCD Offset: 0x0C) (R/W 8) Event Control -------- */
#define SLCD_EVCTRL_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_EVCTRL) Event Control  Reset Value */

#define SLCD_EVCTRL_FC0OEO_Pos                _U_(0)                                               /**< (SLCD_EVCTRL) Frame Counter 0 Overflow Event Output Enable Position */
#define SLCD_EVCTRL_FC0OEO_Msk                (_U_(0x1) << SLCD_EVCTRL_FC0OEO_Pos)                 /**< (SLCD_EVCTRL) Frame Counter 0 Overflow Event Output Enable Mask */
#define SLCD_EVCTRL_FC0OEO(value)             (SLCD_EVCTRL_FC0OEO_Msk & ((value) << SLCD_EVCTRL_FC0OEO_Pos))
#define SLCD_EVCTRL_FC1OEO_Pos                _U_(1)                                               /**< (SLCD_EVCTRL) Frame Counter 1 Overflow Event Output Enable Position */
#define SLCD_EVCTRL_FC1OEO_Msk                (_U_(0x1) << SLCD_EVCTRL_FC1OEO_Pos)                 /**< (SLCD_EVCTRL) Frame Counter 1 Overflow Event Output Enable Mask */
#define SLCD_EVCTRL_FC1OEO(value)             (SLCD_EVCTRL_FC1OEO_Msk & ((value) << SLCD_EVCTRL_FC1OEO_Pos))
#define SLCD_EVCTRL_FC2OEO_Pos                _U_(2)                                               /**< (SLCD_EVCTRL) Frame Counter 2 Overflow Event Output Enable Position */
#define SLCD_EVCTRL_FC2OEO_Msk                (_U_(0x1) << SLCD_EVCTRL_FC2OEO_Pos)                 /**< (SLCD_EVCTRL) Frame Counter 2 Overflow Event Output Enable Mask */
#define SLCD_EVCTRL_FC2OEO(value)             (SLCD_EVCTRL_FC2OEO_Msk & ((value) << SLCD_EVCTRL_FC2OEO_Pos))
#define SLCD_EVCTRL_Msk                       _U_(0x07)                                            /**< (SLCD_EVCTRL) Register Mask  */


/* -------- SLCD_INTENCLR : (SLCD Offset: 0x0D) (R/W 8) Interrupt Enable Clear -------- */
#define SLCD_INTENCLR_RESETVALUE              _U_(0x00)                                            /**<  (SLCD_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SLCD_INTENCLR_FC0O_Pos                _U_(0)                                               /**< (SLCD_INTENCLR) Frame Counter 0 Overflow Interrupt Disable Position */
#define SLCD_INTENCLR_FC0O_Msk                (_U_(0x1) << SLCD_INTENCLR_FC0O_Pos)                 /**< (SLCD_INTENCLR) Frame Counter 0 Overflow Interrupt Disable Mask */
#define SLCD_INTENCLR_FC0O(value)             (SLCD_INTENCLR_FC0O_Msk & ((value) << SLCD_INTENCLR_FC0O_Pos))
#define SLCD_INTENCLR_FC1O_Pos                _U_(1)                                               /**< (SLCD_INTENCLR) Frame Counter 1 Overflow Interrupt Disable Position */
#define SLCD_INTENCLR_FC1O_Msk                (_U_(0x1) << SLCD_INTENCLR_FC1O_Pos)                 /**< (SLCD_INTENCLR) Frame Counter 1 Overflow Interrupt Disable Mask */
#define SLCD_INTENCLR_FC1O(value)             (SLCD_INTENCLR_FC1O_Msk & ((value) << SLCD_INTENCLR_FC1O_Pos))
#define SLCD_INTENCLR_FC2O_Pos                _U_(2)                                               /**< (SLCD_INTENCLR) Frame Counter 2 Overflow Interrupt Disable Position */
#define SLCD_INTENCLR_FC2O_Msk                (_U_(0x1) << SLCD_INTENCLR_FC2O_Pos)                 /**< (SLCD_INTENCLR) Frame Counter 2 Overflow Interrupt Disable Mask */
#define SLCD_INTENCLR_FC2O(value)             (SLCD_INTENCLR_FC2O_Msk & ((value) << SLCD_INTENCLR_FC2O_Pos))
#define SLCD_INTENCLR_VLCDRT_Pos              _U_(3)                                               /**< (SLCD_INTENCLR) VLCD Ready Toggle Interrupt Disable Position */
#define SLCD_INTENCLR_VLCDRT_Msk              (_U_(0x1) << SLCD_INTENCLR_VLCDRT_Pos)               /**< (SLCD_INTENCLR) VLCD Ready Toggle Interrupt Disable Mask */
#define SLCD_INTENCLR_VLCDRT(value)           (SLCD_INTENCLR_VLCDRT_Msk & ((value) << SLCD_INTENCLR_VLCDRT_Pos))
#define SLCD_INTENCLR_VLCDST_Pos              _U_(4)                                               /**< (SLCD_INTENCLR) VLCD Status Toggle Interrupt Disable Position */
#define SLCD_INTENCLR_VLCDST_Msk              (_U_(0x1) << SLCD_INTENCLR_VLCDST_Pos)               /**< (SLCD_INTENCLR) VLCD Status Toggle Interrupt Disable Mask */
#define SLCD_INTENCLR_VLCDST(value)           (SLCD_INTENCLR_VLCDST_Msk & ((value) << SLCD_INTENCLR_VLCDST_Pos))
#define SLCD_INTENCLR_PRST_Pos                _U_(5)                                               /**< (SLCD_INTENCLR) Pump Run Status Toggle Interrupt Disable Position */
#define SLCD_INTENCLR_PRST_Msk                (_U_(0x1) << SLCD_INTENCLR_PRST_Pos)                 /**< (SLCD_INTENCLR) Pump Run Status Toggle Interrupt Disable Mask */
#define SLCD_INTENCLR_PRST(value)             (SLCD_INTENCLR_PRST_Msk & ((value) << SLCD_INTENCLR_PRST_Pos))
#define SLCD_INTENCLR_Msk                     _U_(0x3F)                                            /**< (SLCD_INTENCLR) Register Mask  */


/* -------- SLCD_INTENSET : (SLCD Offset: 0x0E) (R/W 8) Interrupt Enable Set -------- */
#define SLCD_INTENSET_RESETVALUE              _U_(0x00)                                            /**<  (SLCD_INTENSET) Interrupt Enable Set  Reset Value */

#define SLCD_INTENSET_FC0O_Pos                _U_(0)                                               /**< (SLCD_INTENSET) Frame Counter 0 Overflow Interrupt Enable Position */
#define SLCD_INTENSET_FC0O_Msk                (_U_(0x1) << SLCD_INTENSET_FC0O_Pos)                 /**< (SLCD_INTENSET) Frame Counter 0 Overflow Interrupt Enable Mask */
#define SLCD_INTENSET_FC0O(value)             (SLCD_INTENSET_FC0O_Msk & ((value) << SLCD_INTENSET_FC0O_Pos))
#define SLCD_INTENSET_FC1O_Pos                _U_(1)                                               /**< (SLCD_INTENSET) Frame Counter 1 Overflow Interrupt Enable Position */
#define SLCD_INTENSET_FC1O_Msk                (_U_(0x1) << SLCD_INTENSET_FC1O_Pos)                 /**< (SLCD_INTENSET) Frame Counter 1 Overflow Interrupt Enable Mask */
#define SLCD_INTENSET_FC1O(value)             (SLCD_INTENSET_FC1O_Msk & ((value) << SLCD_INTENSET_FC1O_Pos))
#define SLCD_INTENSET_FC2O_Pos                _U_(2)                                               /**< (SLCD_INTENSET) Frame Counter 2 Overflow Interrupt Enable Position */
#define SLCD_INTENSET_FC2O_Msk                (_U_(0x1) << SLCD_INTENSET_FC2O_Pos)                 /**< (SLCD_INTENSET) Frame Counter 2 Overflow Interrupt Enable Mask */
#define SLCD_INTENSET_FC2O(value)             (SLCD_INTENSET_FC2O_Msk & ((value) << SLCD_INTENSET_FC2O_Pos))
#define SLCD_INTENSET_VLCDRT_Pos              _U_(3)                                               /**< (SLCD_INTENSET) VLCD Ready Toggle Interrupt Enable Position */
#define SLCD_INTENSET_VLCDRT_Msk              (_U_(0x1) << SLCD_INTENSET_VLCDRT_Pos)               /**< (SLCD_INTENSET) VLCD Ready Toggle Interrupt Enable Mask */
#define SLCD_INTENSET_VLCDRT(value)           (SLCD_INTENSET_VLCDRT_Msk & ((value) << SLCD_INTENSET_VLCDRT_Pos))
#define SLCD_INTENSET_VLCDST_Pos              _U_(4)                                               /**< (SLCD_INTENSET) VLCD Status Toggle Interrupt Enable Position */
#define SLCD_INTENSET_VLCDST_Msk              (_U_(0x1) << SLCD_INTENSET_VLCDST_Pos)               /**< (SLCD_INTENSET) VLCD Status Toggle Interrupt Enable Mask */
#define SLCD_INTENSET_VLCDST(value)           (SLCD_INTENSET_VLCDST_Msk & ((value) << SLCD_INTENSET_VLCDST_Pos))
#define SLCD_INTENSET_PRST_Pos                _U_(5)                                               /**< (SLCD_INTENSET) Pump Run Status Toggle Interrupt Enable Position */
#define SLCD_INTENSET_PRST_Msk                (_U_(0x1) << SLCD_INTENSET_PRST_Pos)                 /**< (SLCD_INTENSET) Pump Run Status Toggle Interrupt Enable Mask */
#define SLCD_INTENSET_PRST(value)             (SLCD_INTENSET_PRST_Msk & ((value) << SLCD_INTENSET_PRST_Pos))
#define SLCD_INTENSET_Msk                     _U_(0x3F)                                            /**< (SLCD_INTENSET) Register Mask  */


