virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/* -------- SLCD_INTFLAG : (SLCD Offset: 0x0F) (R/W 8) Interrupt Flag Status and Clear -------- */
#define SLCD_INTFLAG_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SLCD_INTFLAG_FC0O_Pos                 _U_(0)                                               /**< (SLCD_INTFLAG) Frame Counter 0 Overflow Position */
#define SLCD_INTFLAG_FC0O_Msk                 (_U_(0x1) << SLCD_INTFLAG_FC0O_Pos)                  /**< (SLCD_INTFLAG) Frame Counter 0 Overflow Mask */
#define SLCD_INTFLAG_FC0O(value)              (SLCD_INTFLAG_FC0O_Msk & ((value) << SLCD_INTFLAG_FC0O_Pos))
#define SLCD_INTFLAG_FC1O_Pos                 _U_(1)                                               /**< (SLCD_INTFLAG) Frame Counter 1 Overflow Position */
#define SLCD_INTFLAG_FC1O_Msk                 (_U_(0x1) << SLCD_INTFLAG_FC1O_Pos)                  /**< (SLCD_INTFLAG) Frame Counter 1 Overflow Mask */
#define SLCD_INTFLAG_FC1O(value)              (SLCD_INTFLAG_FC1O_Msk & ((value) << SLCD_INTFLAG_FC1O_Pos))
#define SLCD_INTFLAG_FC2O_Pos                 _U_(2)                                               /**< (SLCD_INTFLAG) Frame Counter 2 Overflow Position */
#define SLCD_INTFLAG_FC2O_Msk                 (_U_(0x1) << SLCD_INTFLAG_FC2O_Pos)                  /**< (SLCD_INTFLAG) Frame Counter 2 Overflow Mask */
#define SLCD_INTFLAG_FC2O(value)              (SLCD_INTFLAG_FC2O_Msk & ((value) << SLCD_INTFLAG_FC2O_Pos))
#define SLCD_INTFLAG_VLCDRT_Pos               _U_(3)                                               /**< (SLCD_INTFLAG) VLCD Ready Toggle Position */
#define SLCD_INTFLAG_VLCDRT_Msk               (_U_(0x1) << SLCD_INTFLAG_VLCDRT_Pos)                /**< (SLCD_INTFLAG) VLCD Ready Toggle Mask */
#define SLCD_INTFLAG_VLCDRT(value)            (SLCD_INTFLAG_VLCDRT_Msk & ((value) << SLCD_INTFLAG_VLCDRT_Pos))
#define SLCD_INTFLAG_VLCDST_Pos               _U_(4)                                               /**< (SLCD_INTFLAG) VLCD Status Toggle Position */
#define SLCD_INTFLAG_VLCDST_Msk               (_U_(0x1) << SLCD_INTFLAG_VLCDST_Pos)                /**< (SLCD_INTFLAG) VLCD Status Toggle Mask */
#define SLCD_INTFLAG_VLCDST(value)            (SLCD_INTFLAG_VLCDST_Msk & ((value) << SLCD_INTFLAG_VLCDST_Pos))
#define SLCD_INTFLAG_PRST_Pos                 _U_(5)                                               /**< (SLCD_INTFLAG) Pump Run Status Toggle Position */
#define SLCD_INTFLAG_PRST_Msk                 (_U_(0x1) << SLCD_INTFLAG_PRST_Pos)                  /**< (SLCD_INTFLAG) Pump Run Status Toggle Mask */
#define SLCD_INTFLAG_PRST(value)              (SLCD_INTFLAG_PRST_Msk & ((value) << SLCD_INTFLAG_PRST_Pos))
#define SLCD_INTFLAG_Msk                      _U_(0x3F)                                            /**< (SLCD_INTFLAG) Register Mask  */


/* -------- SLCD_STATUS : (SLCD Offset: 0x10) ( R/ 8) Status -------- */
#define SLCD_STATUS_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_STATUS) Status  Reset Value */

#define SLCD_STATUS_VLCDR_Pos                 _U_(0)                                               /**< (SLCD_STATUS) VLCD Ready Position */
#define SLCD_STATUS_VLCDR_Msk                 (_U_(0x1) << SLCD_STATUS_VLCDR_Pos)                  /**< (SLCD_STATUS) VLCD Ready Mask */
#define SLCD_STATUS_VLCDR(value)              (SLCD_STATUS_VLCDR_Msk & ((value) << SLCD_STATUS_VLCDR_Pos))
#define SLCD_STATUS_PRUN_Pos                  _U_(1)                                               /**< (SLCD_STATUS) LCD Charge Pump is Running Position */
#define SLCD_STATUS_PRUN_Msk                  (_U_(0x1) << SLCD_STATUS_PRUN_Pos)                   /**< (SLCD_STATUS) LCD Charge Pump is Running Mask */
#define SLCD_STATUS_PRUN(value)               (SLCD_STATUS_PRUN_Msk & ((value) << SLCD_STATUS_PRUN_Pos))
#define SLCD_STATUS_VLCDS_Pos                 _U_(2)                                               /**< (SLCD_STATUS) VLCD Status Position */
#define SLCD_STATUS_VLCDS_Msk                 (_U_(0x1) << SLCD_STATUS_VLCDS_Pos)                  /**< (SLCD_STATUS) VLCD Status Mask */
#define SLCD_STATUS_VLCDS(value)              (SLCD_STATUS_VLCDS_Msk & ((value) << SLCD_STATUS_VLCDS_Pos))
#define SLCD_STATUS_CMWRBUSY_Pos              _U_(3)                                               /**< (SLCD_STATUS) Character mapping write busy Position */
#define SLCD_STATUS_CMWRBUSY_Msk              (_U_(0x1) << SLCD_STATUS_CMWRBUSY_Pos)               /**< (SLCD_STATUS) Character mapping write busy Mask */
#define SLCD_STATUS_CMWRBUSY(value)           (SLCD_STATUS_CMWRBUSY_Msk & ((value) << SLCD_STATUS_CMWRBUSY_Pos))
#define SLCD_STATUS_ACMBUSY_Pos               _U_(4)                                               /**< (SLCD_STATUS) ACM state machine busy Position */
#define SLCD_STATUS_ACMBUSY_Msk               (_U_(0x1) << SLCD_STATUS_ACMBUSY_Pos)                /**< (SLCD_STATUS) ACM state machine busy Mask */
#define SLCD_STATUS_ACMBUSY(value)            (SLCD_STATUS_ACMBUSY_Msk & ((value) << SLCD_STATUS_ACMBUSY_Pos))
#define SLCD_STATUS_ABMBUSY_Pos               _U_(5)                                               /**< (SLCD_STATUS) ABM state machine busy Position */
#define SLCD_STATUS_ABMBUSY_Msk               (_U_(0x1) << SLCD_STATUS_ABMBUSY_Pos)                /**< (SLCD_STATUS) ABM state machine busy Mask */
#define SLCD_STATUS_ABMBUSY(value)            (SLCD_STATUS_ABMBUSY_Msk & ((value) << SLCD_STATUS_ABMBUSY_Pos))
#define SLCD_STATUS_Msk                       _U_(0x3F)                                            /**< (SLCD_STATUS) Register Mask  */


/* -------- SLCD_SYNCBUSY : (SLCD Offset: 0x14) ( R/ 32) Synchronization Busy -------- */
#define SLCD_SYNCBUSY_RESETVALUE              _U_(0x00)                                            /**<  (SLCD_SYNCBUSY) Synchronization Busy  Reset Value */

#define SLCD_SYNCBUSY_SWRST_Pos               _U_(0)                                               /**< (SLCD_SYNCBUSY) Software Reset Position */
#define SLCD_SYNCBUSY_SWRST_Msk               (_U_(0x1) << SLCD_SYNCBUSY_SWRST_Pos)                /**< (SLCD_SYNCBUSY) Software Reset Mask */
#define SLCD_SYNCBUSY_SWRST(value)            (SLCD_SYNCBUSY_SWRST_Msk & ((value) << SLCD_SYNCBUSY_SWRST_Pos))
#define SLCD_SYNCBUSY_ENABLE_Pos              _U_(1)                                               /**< (SLCD_SYNCBUSY) Enable Position */
#define SLCD_SYNCBUSY_ENABLE_Msk              (_U_(0x1) << SLCD_SYNCBUSY_ENABLE_Pos)               /**< (SLCD_SYNCBUSY) Enable Mask */
#define SLCD_SYNCBUSY_ENABLE(value)           (SLCD_SYNCBUSY_ENABLE_Msk & ((value) << SLCD_SYNCBUSY_ENABLE_Pos))
#define SLCD_SYNCBUSY_CTRLD_Pos               _U_(2)                                               /**< (SLCD_SYNCBUSY) Control D Position */
#define SLCD_SYNCBUSY_CTRLD_Msk               (_U_(0x1) << SLCD_SYNCBUSY_CTRLD_Pos)                /**< (SLCD_SYNCBUSY) Control D Mask */
#define SLCD_SYNCBUSY_CTRLD(value)            (SLCD_SYNCBUSY_CTRLD_Msk & ((value) << SLCD_SYNCBUSY_CTRLD_Pos))
#define SLCD_SYNCBUSY_Msk                     _U_(0x00000007)                                      /**< (SLCD_SYNCBUSY) Register Mask  */


/* -------- SLCD_FC0 : (SLCD Offset: 0x18) (R/W 8) Frame Counter 0 Configuration -------- */
#define SLCD_FC0_RESETVALUE                   _U_(0x00)                                            /**<  (SLCD_FC0) Frame Counter 0 Configuration  Reset Value */

#define SLCD_FC0_OVF_Pos                      _U_(0)                                               /**< (SLCD_FC0) Frame Counter Overflow Value Position */
#define SLCD_FC0_OVF_Msk                      (_U_(0x1F) << SLCD_FC0_OVF_Pos)                      /**< (SLCD_FC0) Frame Counter Overflow Value Mask */
#define SLCD_FC0_OVF(value)                   (SLCD_FC0_OVF_Msk & ((value) << SLCD_FC0_OVF_Pos))  
#define SLCD_FC0_PB_Pos                       _U_(7)                                               /**< (SLCD_FC0) Prescaler Bypass Position */
#define SLCD_FC0_PB_Msk                       (_U_(0x1) << SLCD_FC0_PB_Pos)                        /**< (SLCD_FC0) Prescaler Bypass Mask */
#define SLCD_FC0_PB(value)                    (SLCD_FC0_PB_Msk & ((value) << SLCD_FC0_PB_Pos))    
#define SLCD_FC0_Msk                          _U_(0x9F)                                            /**< (SLCD_FC0) Register Mask  */


