virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/* -------- SLCD_FC1 : (SLCD Offset: 0x19) (R/W 8) Frame Counter 1 Configuration -------- */
#define SLCD_FC1_RESETVALUE                   _U_(0x00)                                            /**<  (SLCD_FC1) Frame Counter 1 Configuration  Reset Value */

#define SLCD_FC1_OVF_Pos                      _U_(0)                                               /**< (SLCD_FC1) Frame Counter Overflow Value Position */
#define SLCD_FC1_OVF_Msk                      (_U_(0x1F) << SLCD_FC1_OVF_Pos)                      /**< (SLCD_FC1) Frame Counter Overflow Value Mask */
#define SLCD_FC1_OVF(value)                   (SLCD_FC1_OVF_Msk & ((value) << SLCD_FC1_OVF_Pos))  
#define SLCD_FC1_PB_Pos                       _U_(7)                                               /**< (SLCD_FC1) Prescaler Bypass Position */
#define SLCD_FC1_PB_Msk                       (_U_(0x1) << SLCD_FC1_PB_Pos)                        /**< (SLCD_FC1) Prescaler Bypass Mask */
#define SLCD_FC1_PB(value)                    (SLCD_FC1_PB_Msk & ((value) << SLCD_FC1_PB_Pos))    
#define SLCD_FC1_Msk                          _U_(0x9F)                                            /**< (SLCD_FC1) Register Mask  */


/* -------- SLCD_FC2 : (SLCD Offset: 0x1A) (R/W 8) Frame Counter 2 Configuration -------- */
#define SLCD_FC2_RESETVALUE                   _U_(0x00)                                            /**<  (SLCD_FC2) Frame Counter 2 Configuration  Reset Value */

#define SLCD_FC2_OVF_Pos                      _U_(0)                                               /**< (SLCD_FC2) Frame Counter Overflow Value Position */
#define SLCD_FC2_OVF_Msk                      (_U_(0x1F) << SLCD_FC2_OVF_Pos)                      /**< (SLCD_FC2) Frame Counter Overflow Value Mask */
#define SLCD_FC2_OVF(value)                   (SLCD_FC2_OVF_Msk & ((value) << SLCD_FC2_OVF_Pos))  
#define SLCD_FC2_PB_Pos                       _U_(7)                                               /**< (SLCD_FC2) Prescaler Bypass Position */
#define SLCD_FC2_PB_Msk                       (_U_(0x1) << SLCD_FC2_PB_Pos)                        /**< (SLCD_FC2) Prescaler Bypass Mask */
#define SLCD_FC2_PB(value)                    (SLCD_FC2_PB_Msk & ((value) << SLCD_FC2_PB_Pos))    
#define SLCD_FC2_Msk                          _U_(0x9F)                                            /**< (SLCD_FC2) Register Mask  */


/* -------- SLCD_LPENL : (SLCD Offset: 0x1C) (R/W 32) LCD Pin Enable Low -------- */
#define SLCD_LPENL_RESETVALUE                 _U_(0x00)                                            /**<  (SLCD_LPENL) LCD Pin Enable Low  Reset Value */

#define SLCD_LPENL_LPEN_Pos                   _U_(0)                                               /**< (SLCD_LPENL) LCD Pin Enable Position */
#define SLCD_LPENL_LPEN_Msk                   (_U_(0xFFFFFFFF) << SLCD_LPENL_LPEN_Pos)             /**< (SLCD_LPENL) LCD Pin Enable Mask */
#define SLCD_LPENL_LPEN(value)                (SLCD_LPENL_LPEN_Msk & ((value) << SLCD_LPENL_LPEN_Pos))
#define SLCD_LPENL_Msk                        _U_(0xFFFFFFFF)                                      /**< (SLCD_LPENL) Register Mask  */


/* -------- SLCD_LPENH : (SLCD Offset: 0x20) (R/W 32) LCD Pin Enable High -------- */
#define SLCD_LPENH_RESETVALUE                 _U_(0x00)                                            /**<  (SLCD_LPENH) LCD Pin Enable High  Reset Value */

#define SLCD_LPENH_LPEN_Pos                   _U_(0)                                               /**< (SLCD_LPENH) LCD Pin Enable Position */
#define SLCD_LPENH_LPEN_Msk                   (_U_(0xFFFFF) << SLCD_LPENH_LPEN_Pos)                /**< (SLCD_LPENH) LCD Pin Enable Mask */
#define SLCD_LPENH_LPEN(value)                (SLCD_LPENH_LPEN_Msk & ((value) << SLCD_LPENH_LPEN_Pos))
#define SLCD_LPENH_Msk                        _U_(0x000FFFFF)                                      /**< (SLCD_LPENH) Register Mask  */


/* -------- SLCD_SDATAL0 : (SLCD Offset: 0x24) (R/W 32) Segments Data Low for COM0 Line -------- */
#define SLCD_SDATAL0_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL0) Segments Data Low for COM0 Line  Reset Value */

#define SLCD_SDATAL0_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL0) Segments Data Position */
#define SLCD_SDATAL0_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL0_SDATA_Pos)          /**< (SLCD_SDATAL0) Segments Data Mask */
#define SLCD_SDATAL0_SDATA(value)             (SLCD_SDATAL0_SDATA_Msk & ((value) << SLCD_SDATAL0_SDATA_Pos))
#define SLCD_SDATAL0_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL0) Register Mask  */


/* -------- SLCD_SDATAH0 : (SLCD Offset: 0x28) (R/W 32) Segments Data High for COM0 Line -------- */
#define SLCD_SDATAH0_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH0) Segments Data High for COM0 Line  Reset Value */

#define SLCD_SDATAH0_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH0) Segments Data Position */
#define SLCD_SDATAH0_SDATA_Msk                (_U_(0xFFF) << SLCD_SDATAH0_SDATA_Pos)               /**< (SLCD_SDATAH0) Segments Data Mask */
#define SLCD_SDATAH0_SDATA(value)             (SLCD_SDATAH0_SDATA_Msk & ((value) << SLCD_SDATAH0_SDATA_Pos))
#define SLCD_SDATAH0_Msk                      _U_(0x00000FFF)                                      /**< (SLCD_SDATAH0) Register Mask  */


/* -------- SLCD_SDATAL1 : (SLCD Offset: 0x2C) (R/W 32) Segments Data Low for COM1 Line -------- */
#define SLCD_SDATAL1_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL1) Segments Data Low for COM1 Line  Reset Value */

#define SLCD_SDATAL1_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL1) Segments Data Position */
#define SLCD_SDATAL1_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL1_SDATA_Pos)          /**< (SLCD_SDATAL1) Segments Data Mask */
#define SLCD_SDATAL1_SDATA(value)             (SLCD_SDATAL1_SDATA_Msk & ((value) << SLCD_SDATAL1_SDATA_Pos))
#define SLCD_SDATAL1_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL1) Register Mask  */


/* -------- SLCD_SDATAH1 : (SLCD Offset: 0x30) (R/W 32) Segments Data High for COM1 Line -------- */
#define SLCD_SDATAH1_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH1) Segments Data High for COM1 Line  Reset Value */

#define SLCD_SDATAH1_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH1) Segments Data Position */
#define SLCD_SDATAH1_SDATA_Msk                (_U_(0xFFF) << SLCD_SDATAH1_SDATA_Pos)               /**< (SLCD_SDATAH1) Segments Data Mask */
#define SLCD_SDATAH1_SDATA(value)             (SLCD_SDATAH1_SDATA_Msk & ((value) << SLCD_SDATAH1_SDATA_Pos))
#define SLCD_SDATAH1_Msk                      _U_(0x00000FFF)                                      /**< (SLCD_SDATAH1) Register Mask  */


/* -------- SLCD_SDATAL2 : (SLCD Offset: 0x34) (R/W 32) Segments Data Low for COM2 Line -------- */
#define SLCD_SDATAL2_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL2) Segments Data Low for COM2 Line  Reset Value */

#define SLCD_SDATAL2_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL2) Segments Data Position */
#define SLCD_SDATAL2_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL2_SDATA_Pos)          /**< (SLCD_SDATAL2) Segments Data Mask */
#define SLCD_SDATAL2_SDATA(value)             (SLCD_SDATAL2_SDATA_Msk & ((value) << SLCD_SDATAL2_SDATA_Pos))
#define SLCD_SDATAL2_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL2) Register Mask  */


/* -------- SLCD_SDATAH2 : (SLCD Offset: 0x38) (R/W 32) Segments Data High for COM2 Line -------- */
#define SLCD_SDATAH2_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH2) Segments Data High for COM2 Line  Reset Value */

#define SLCD_SDATAH2_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH2) Segments Data Position */
#define SLCD_SDATAH2_SDATA_Msk                (_U_(0xFFF) << SLCD_SDATAH2_SDATA_Pos)               /**< (SLCD_SDATAH2) Segments Data Mask */
#define SLCD_SDATAH2_SDATA(value)             (SLCD_SDATAH2_SDATA_Msk & ((value) << SLCD_SDATAH2_SDATA_Pos))
#define SLCD_SDATAH2_Msk                      _U_(0x00000FFF)                                      /**< (SLCD_SDATAH2) Register Mask  */


