virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/* -------- SLCD_SDATAL3 : (SLCD Offset: 0x3C) (R/W 32) Segments Data Low for COM3 Line -------- */
#define SLCD_SDATAL3_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL3) Segments Data Low for COM3 Line  Reset Value */

#define SLCD_SDATAL3_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL3) Segments Data Position */
#define SLCD_SDATAL3_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL3_SDATA_Pos)          /**< (SLCD_SDATAL3) Segments Data Mask */
#define SLCD_SDATAL3_SDATA(value)             (SLCD_SDATAL3_SDATA_Msk & ((value) << SLCD_SDATAL3_SDATA_Pos))
#define SLCD_SDATAL3_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL3) Register Mask  */


/* -------- SLCD_SDATAH3 : (SLCD Offset: 0x40) (R/W 32) Segments Data High for COM3 Line -------- */
#define SLCD_SDATAH3_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH3) Segments Data High for COM3 Line  Reset Value */

#define SLCD_SDATAH3_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH3) Segments Data Position */
#define SLCD_SDATAH3_SDATA_Msk                (_U_(0xFFF) << SLCD_SDATAH3_SDATA_Pos)               /**< (SLCD_SDATAH3) Segments Data Mask */
#define SLCD_SDATAH3_SDATA(value)             (SLCD_SDATAH3_SDATA_Msk & ((value) << SLCD_SDATAH3_SDATA_Pos))
#define SLCD_SDATAH3_Msk                      _U_(0x00000FFF)                                      /**< (SLCD_SDATAH3) Register Mask  */


/* -------- SLCD_SDATAL4 : (SLCD Offset: 0x44) (R/W 32) Segments Data Low for COM4 Line -------- */
#define SLCD_SDATAL4_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL4) Segments Data Low for COM4 Line  Reset Value */

#define SLCD_SDATAL4_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL4) Segments Data Position */
#define SLCD_SDATAL4_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL4_SDATA_Pos)          /**< (SLCD_SDATAL4) Segments Data Mask */
#define SLCD_SDATAL4_SDATA(value)             (SLCD_SDATAL4_SDATA_Msk & ((value) << SLCD_SDATAL4_SDATA_Pos))
#define SLCD_SDATAL4_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL4) Register Mask  */


/* -------- SLCD_SDATAH4 : (SLCD Offset: 0x48) (R/W 32) Segments Data High for COM4 Line -------- */
#define SLCD_SDATAH4_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH4) Segments Data High for COM4 Line  Reset Value */

#define SLCD_SDATAH4_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH4) Segments Data Position */
#define SLCD_SDATAH4_SDATA_Msk                (_U_(0x3FF) << SLCD_SDATAH4_SDATA_Pos)               /**< (SLCD_SDATAH4) Segments Data Mask */
#define SLCD_SDATAH4_SDATA(value)             (SLCD_SDATAH4_SDATA_Msk & ((value) << SLCD_SDATAH4_SDATA_Pos))
#define SLCD_SDATAH4_Msk                      _U_(0x000003FF)                                      /**< (SLCD_SDATAH4) Register Mask  */


/* -------- SLCD_SDATAL5 : (SLCD Offset: 0x4C) (R/W 32) Segments Data Low for COM5 Line -------- */
#define SLCD_SDATAL5_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL5) Segments Data Low for COM5 Line  Reset Value */

#define SLCD_SDATAL5_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL5) Segments Data Position */
#define SLCD_SDATAL5_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL5_SDATA_Pos)          /**< (SLCD_SDATAL5) Segments Data Mask */
#define SLCD_SDATAL5_SDATA(value)             (SLCD_SDATAL5_SDATA_Msk & ((value) << SLCD_SDATAL5_SDATA_Pos))
#define SLCD_SDATAL5_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL5) Register Mask  */


/* -------- SLCD_SDATAH5 : (SLCD Offset: 0x50) (R/W 32) Segments Data High for COM5 Line -------- */
#define SLCD_SDATAH5_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH5) Segments Data High for COM5 Line  Reset Value */

#define SLCD_SDATAH5_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH5) Segments Data Position */
#define SLCD_SDATAH5_SDATA_Msk                (_U_(0x3FF) << SLCD_SDATAH5_SDATA_Pos)               /**< (SLCD_SDATAH5) Segments Data Mask */
#define SLCD_SDATAH5_SDATA(value)             (SLCD_SDATAH5_SDATA_Msk & ((value) << SLCD_SDATAH5_SDATA_Pos))
#define SLCD_SDATAH5_Msk                      _U_(0x000003FF)                                      /**< (SLCD_SDATAH5) Register Mask  */


/* -------- SLCD_SDATAL6 : (SLCD Offset: 0x54) (R/W 32) Segments Data Low for COM6 Line -------- */
#define SLCD_SDATAL6_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL6) Segments Data Low for COM6 Line  Reset Value */

#define SLCD_SDATAL6_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL6) Segments Data Position */
#define SLCD_SDATAL6_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL6_SDATA_Pos)          /**< (SLCD_SDATAL6) Segments Data Mask */
#define SLCD_SDATAL6_SDATA(value)             (SLCD_SDATAL6_SDATA_Msk & ((value) << SLCD_SDATAL6_SDATA_Pos))
#define SLCD_SDATAL6_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL6) Register Mask  */


/* -------- SLCD_SDATAH6 : (SLCD Offset: 0x58) (R/W 32) Segments Data High for COM6 Line -------- */
#define SLCD_SDATAH6_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH6) Segments Data High for COM6 Line  Reset Value */

#define SLCD_SDATAH6_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH6) Segments Data Position */
#define SLCD_SDATAH6_SDATA_Msk                (_U_(0xFF) << SLCD_SDATAH6_SDATA_Pos)                /**< (SLCD_SDATAH6) Segments Data Mask */
#define SLCD_SDATAH6_SDATA(value)             (SLCD_SDATAH6_SDATA_Msk & ((value) << SLCD_SDATAH6_SDATA_Pos))
#define SLCD_SDATAH6_Msk                      _U_(0x000000FF)                                      /**< (SLCD_SDATAH6) Register Mask  */


/* -------- SLCD_SDATAL7 : (SLCD Offset: 0x5C) (R/W 32) Segments Data Low for COM7 Line -------- */
#define SLCD_SDATAL7_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAL7) Segments Data Low for COM7 Line  Reset Value */

