virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
#define SLCD_SDATAL7_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAL7) Segments Data Position */
#define SLCD_SDATAL7_SDATA_Msk                (_U_(0xFFFFFFFF) << SLCD_SDATAL7_SDATA_Pos)          /**< (SLCD_SDATAL7) Segments Data Mask */
#define SLCD_SDATAL7_SDATA(value)             (SLCD_SDATAL7_SDATA_Msk & ((value) << SLCD_SDATAL7_SDATA_Pos))
#define SLCD_SDATAL7_Msk                      _U_(0xFFFFFFFF)                                      /**< (SLCD_SDATAL7) Register Mask  */


/* -------- SLCD_SDATAH7 : (SLCD Offset: 0x60) (R/W 32) Segments Data High for COM7 Line -------- */
#define SLCD_SDATAH7_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_SDATAH7) Segments Data High for COM7 Line  Reset Value */

#define SLCD_SDATAH7_SDATA_Pos                _U_(0)                                               /**< (SLCD_SDATAH7) Segments Data Position */
#define SLCD_SDATAH7_SDATA_Msk                (_U_(0xFF) << SLCD_SDATAH7_SDATA_Pos)                /**< (SLCD_SDATAH7) Segments Data Mask */
#define SLCD_SDATAH7_SDATA(value)             (SLCD_SDATAH7_SDATA_Msk & ((value) << SLCD_SDATAH7_SDATA_Pos))
#define SLCD_SDATAH7_Msk                      _U_(0x000000FF)                                      /**< (SLCD_SDATAH7) Register Mask  */


/* -------- SLCD_ISDATA : (SLCD Offset: 0x64) ( /W 32) Indirect Segments Data Access -------- */
#define SLCD_ISDATA_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_ISDATA) Indirect Segments Data Access  Reset Value */

#define SLCD_ISDATA_SDATA_Pos                 _U_(0)                                               /**< (SLCD_ISDATA) Segments Data Position */
#define SLCD_ISDATA_SDATA_Msk                 (_U_(0xFF) << SLCD_ISDATA_SDATA_Pos)                 /**< (SLCD_ISDATA) Segments Data Mask */
#define SLCD_ISDATA_SDATA(value)              (SLCD_ISDATA_SDATA_Msk & ((value) << SLCD_ISDATA_SDATA_Pos))
#define SLCD_ISDATA_SDMASK_Pos                _U_(8)                                               /**< (SLCD_ISDATA) Segments Data Mask Position */
#define SLCD_ISDATA_SDMASK_Msk                (_U_(0xFF) << SLCD_ISDATA_SDMASK_Pos)                /**< (SLCD_ISDATA) Segments Data Mask Mask */
#define SLCD_ISDATA_SDMASK(value)             (SLCD_ISDATA_SDMASK_Msk & ((value) << SLCD_ISDATA_SDMASK_Pos))
#define SLCD_ISDATA_OFF_Pos                   _U_(16)                                              /**< (SLCD_ISDATA) Byte Offset Position */
#define SLCD_ISDATA_OFF_Msk                   (_U_(0x3F) << SLCD_ISDATA_OFF_Pos)                   /**< (SLCD_ISDATA) Byte Offset Mask */
#define SLCD_ISDATA_OFF(value)                (SLCD_ISDATA_OFF_Msk & ((value) << SLCD_ISDATA_OFF_Pos))
#define SLCD_ISDATA_Msk                       _U_(0x003FFFFF)                                      /**< (SLCD_ISDATA) Register Mask  */


/* -------- SLCD_BCFG : (SLCD Offset: 0x68) (R/W 32) Blink Configuration -------- */
#define SLCD_BCFG_RESETVALUE                  _U_(0x00)                                            /**<  (SLCD_BCFG) Blink Configuration  Reset Value */

#define SLCD_BCFG_MODE_Pos                    _U_(0)                                               /**< (SLCD_BCFG) Blinking Mode Position */
#define SLCD_BCFG_MODE_Msk                    (_U_(0x1) << SLCD_BCFG_MODE_Pos)                     /**< (SLCD_BCFG) Blinking Mode Mask */
#define SLCD_BCFG_MODE(value)                 (SLCD_BCFG_MODE_Msk & ((value) << SLCD_BCFG_MODE_Pos))
#define   SLCD_BCFG_MODE_BLINKALL_Val         _U_(0x0)                                             /**< (SLCD_BCFG) Blink all segments  */
#define   SLCD_BCFG_MODE_BLINKSEL_Val         _U_(0x1)                                             /**< (SLCD_BCFG) Blink selected segments  */
#define SLCD_BCFG_MODE_BLINKALL               (SLCD_BCFG_MODE_BLINKALL_Val << SLCD_BCFG_MODE_Pos)  /**< (SLCD_BCFG) Blink all segments Position  */
#define SLCD_BCFG_MODE_BLINKSEL               (SLCD_BCFG_MODE_BLINKSEL_Val << SLCD_BCFG_MODE_Pos)  /**< (SLCD_BCFG) Blink selected segments Position  */
#define SLCD_BCFG_FCS_Pos                     _U_(1)                                               /**< (SLCD_BCFG) Frame Counter Selection Position */
#define SLCD_BCFG_FCS_Msk                     (_U_(0x3) << SLCD_BCFG_FCS_Pos)                      /**< (SLCD_BCFG) Frame Counter Selection Mask */
#define SLCD_BCFG_FCS(value)                  (SLCD_BCFG_FCS_Msk & ((value) << SLCD_BCFG_FCS_Pos))
#define   SLCD_BCFG_FCS_FC0_Val               _U_(0x0)                                             /**< (SLCD_BCFG) Frame Counter 0  */
#define   SLCD_BCFG_FCS_FC1_Val               _U_(0x1)                                             /**< (SLCD_BCFG) Frame Counter 1  */
#define   SLCD_BCFG_FCS_FC2_Val               _U_(0x2)                                             /**< (SLCD_BCFG) Frame Counter 2  */
#define SLCD_BCFG_FCS_FC0                     (SLCD_BCFG_FCS_FC0_Val << SLCD_BCFG_FCS_Pos)         /**< (SLCD_BCFG) Frame Counter 0 Position  */
#define SLCD_BCFG_FCS_FC1                     (SLCD_BCFG_FCS_FC1_Val << SLCD_BCFG_FCS_Pos)         /**< (SLCD_BCFG) Frame Counter 1 Position  */
#define SLCD_BCFG_FCS_FC2                     (SLCD_BCFG_FCS_FC2_Val << SLCD_BCFG_FCS_Pos)         /**< (SLCD_BCFG) Frame Counter 2 Position  */
#define SLCD_BCFG_BSS0_Pos                    _U_(8)                                               /**< (SLCD_BCFG) Blink Segment Selection 0 Position */
#define SLCD_BCFG_BSS0_Msk                    (_U_(0xFF) << SLCD_BCFG_BSS0_Pos)                    /**< (SLCD_BCFG) Blink Segment Selection 0 Mask */
#define SLCD_BCFG_BSS0(value)                 (SLCD_BCFG_BSS0_Msk & ((value) << SLCD_BCFG_BSS0_Pos))
#define SLCD_BCFG_BSS1_Pos                    _U_(16)                                              /**< (SLCD_BCFG) Blink Segment Selection 1 Position */
#define SLCD_BCFG_BSS1_Msk                    (_U_(0xFF) << SLCD_BCFG_BSS1_Pos)                    /**< (SLCD_BCFG) Blink Segment Selection 1 Mask */
#define SLCD_BCFG_BSS1(value)                 (SLCD_BCFG_BSS1_Msk & ((value) << SLCD_BCFG_BSS1_Pos))
#define SLCD_BCFG_Msk                         _U_(0x00FFFF07)                                      /**< (SLCD_BCFG) Register Mask  */


/* -------- SLCD_CSRCFG : (SLCD Offset: 0x6C) (R/W 32) Circular Shift Register Configuration -------- */
#define SLCD_CSRCFG_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_CSRCFG) Circular Shift Register Configuration  Reset Value */

#define SLCD_CSRCFG_DIR_Pos                   _U_(0)                                               /**< (SLCD_CSRCFG) Direction Position */
#define SLCD_CSRCFG_DIR_Msk                   (_U_(0x1) << SLCD_CSRCFG_DIR_Pos)                    /**< (SLCD_CSRCFG) Direction Mask */
#define SLCD_CSRCFG_DIR(value)                (SLCD_CSRCFG_DIR_Msk & ((value) << SLCD_CSRCFG_DIR_Pos))
#define SLCD_CSRCFG_FCS_Pos                   _U_(1)                                               /**< (SLCD_CSRCFG) Frame Counter Selection Position */
#define SLCD_CSRCFG_FCS_Msk                   (_U_(0x3) << SLCD_CSRCFG_FCS_Pos)                    /**< (SLCD_CSRCFG) Frame Counter Selection Mask */
#define SLCD_CSRCFG_FCS(value)                (SLCD_CSRCFG_FCS_Msk & ((value) << SLCD_CSRCFG_FCS_Pos))
#define   SLCD_CSRCFG_FCS_FC0_Val             _U_(0x0)                                             /**< (SLCD_CSRCFG) Frame Counter 0  */
#define   SLCD_CSRCFG_FCS_FC1_Val             _U_(0x1)                                             /**< (SLCD_CSRCFG) Frame Counter 1  */
#define   SLCD_CSRCFG_FCS_FC2_Val             _U_(0x2)                                             /**< (SLCD_CSRCFG) Frame Counter 2  */
#define SLCD_CSRCFG_FCS_FC0                   (SLCD_CSRCFG_FCS_FC0_Val << SLCD_CSRCFG_FCS_Pos)     /**< (SLCD_CSRCFG) Frame Counter 0 Position  */
#define SLCD_CSRCFG_FCS_FC1                   (SLCD_CSRCFG_FCS_FC1_Val << SLCD_CSRCFG_FCS_Pos)     /**< (SLCD_CSRCFG) Frame Counter 1 Position  */
#define SLCD_CSRCFG_FCS_FC2                   (SLCD_CSRCFG_FCS_FC2_Val << SLCD_CSRCFG_FCS_Pos)     /**< (SLCD_CSRCFG) Frame Counter 2 Position  */
#define SLCD_CSRCFG_SIZE_Pos                  _U_(4)                                               /**< (SLCD_CSRCFG) Circular Shift Register Size Position */
#define SLCD_CSRCFG_SIZE_Msk                  (_U_(0xF) << SLCD_CSRCFG_SIZE_Pos)                   /**< (SLCD_CSRCFG) Circular Shift Register Size Mask */
#define SLCD_CSRCFG_SIZE(value)               (SLCD_CSRCFG_SIZE_Msk & ((value) << SLCD_CSRCFG_SIZE_Pos))
#define SLCD_CSRCFG_DATA_Pos                  _U_(8)                                               /**< (SLCD_CSRCFG) Circular Shift Register Value Position */
#define SLCD_CSRCFG_DATA_Msk                  (_U_(0xFFFF) << SLCD_CSRCFG_DATA_Pos)                /**< (SLCD_CSRCFG) Circular Shift Register Value Mask */
#define SLCD_CSRCFG_DATA(value)               (SLCD_CSRCFG_DATA_Msk & ((value) << SLCD_CSRCFG_DATA_Pos))
#define SLCD_CSRCFG_Msk                       _U_(0x00FFFFF7)                                      /**< (SLCD_CSRCFG) Register Mask  */


