virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/* -------- SLCD_CMCFG : (SLCD Offset: 0x70) (R/W 8) Character Mapping Configuration -------- */
#define SLCD_CMCFG_RESETVALUE                 _U_(0x00)                                            /**<  (SLCD_CMCFG) Character Mapping Configuration  Reset Value */

#define SLCD_CMCFG_NSEG_Pos                   _U_(0)                                               /**< (SLCD_CMCFG) Number of SEG lines Position */
#define SLCD_CMCFG_NSEG_Msk                   (_U_(0x7) << SLCD_CMCFG_NSEG_Pos)                    /**< (SLCD_CMCFG) Number of SEG lines Mask */
#define SLCD_CMCFG_NSEG(value)                (SLCD_CMCFG_NSEG_Msk & ((value) << SLCD_CMCFG_NSEG_Pos))
#define SLCD_CMCFG_DEC_Pos                    _U_(3)                                               /**< (SLCD_CMCFG) Decrement SEG Line Index Position */
#define SLCD_CMCFG_DEC_Msk                    (_U_(0x1) << SLCD_CMCFG_DEC_Pos)                     /**< (SLCD_CMCFG) Decrement SEG Line Index Mask */
#define SLCD_CMCFG_DEC(value)                 (SLCD_CMCFG_DEC_Msk & ((value) << SLCD_CMCFG_DEC_Pos))
#define SLCD_CMCFG_Msk                        _U_(0x0F)                                            /**< (SLCD_CMCFG) Register Mask  */


/* -------- SLCD_ACMCFG : (SLCD Offset: 0x74) (R/W 32) Automated Character Mapping Configuration -------- */
#define SLCD_ACMCFG_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_ACMCFG) Automated Character Mapping Configuration  Reset Value */

#define SLCD_ACMCFG_NCOM_Pos                  _U_(0)                                               /**< (SLCD_ACMCFG) COM Lines per Row Position */
#define SLCD_ACMCFG_NCOM_Msk                  (_U_(0x7) << SLCD_ACMCFG_NCOM_Pos)                   /**< (SLCD_ACMCFG) COM Lines per Row Mask */
#define SLCD_ACMCFG_NCOM(value)               (SLCD_ACMCFG_NCOM_Msk & ((value) << SLCD_ACMCFG_NCOM_Pos))
#define SLCD_ACMCFG_NDIG_Pos                  _U_(4)                                               /**< (SLCD_ACMCFG) Number of Digit Position */
#define SLCD_ACMCFG_NDIG_Msk                  (_U_(0xF) << SLCD_ACMCFG_NDIG_Pos)                   /**< (SLCD_ACMCFG) Number of Digit Mask */
#define SLCD_ACMCFG_NDIG(value)               (SLCD_ACMCFG_NDIG_Msk & ((value) << SLCD_ACMCFG_NDIG_Pos))
#define SLCD_ACMCFG_STEPS_Pos                 _U_(8)                                               /**< (SLCD_ACMCFG) Scrolling Steps Position */
#define SLCD_ACMCFG_STEPS_Msk                 (_U_(0xFF) << SLCD_ACMCFG_STEPS_Pos)                 /**< (SLCD_ACMCFG) Scrolling Steps Mask */
#define SLCD_ACMCFG_STEPS(value)              (SLCD_ACMCFG_STEPS_Msk & ((value) << SLCD_ACMCFG_STEPS_Pos))
#define SLCD_ACMCFG_NDROW_Pos                 _U_(16)                                              /**< (SLCD_ACMCFG) Number of Digit per Row Position */
#define SLCD_ACMCFG_NDROW_Msk                 (_U_(0x3F) << SLCD_ACMCFG_NDROW_Pos)                 /**< (SLCD_ACMCFG) Number of Digit per Row Mask */
#define SLCD_ACMCFG_NDROW(value)              (SLCD_ACMCFG_NDROW_Msk & ((value) << SLCD_ACMCFG_NDROW_Pos))
#define SLCD_ACMCFG_MODE_Pos                  _U_(23)                                              /**< (SLCD_ACMCFG) Mode Position */
#define SLCD_ACMCFG_MODE_Msk                  (_U_(0x1) << SLCD_ACMCFG_MODE_Pos)                   /**< (SLCD_ACMCFG) Mode Mask */
#define SLCD_ACMCFG_MODE(value)               (SLCD_ACMCFG_MODE_Msk & ((value) << SLCD_ACMCFG_MODE_Pos))
#define   SLCD_ACMCFG_MODE_SEQ_Val            _U_(0x0)                                             /**< (SLCD_ACMCFG) Sequential Display Mode  */
#define   SLCD_ACMCFG_MODE_SCROLL_Val         _U_(0x1)                                             /**< (SLCD_ACMCFG) Scrolling Display Mode  */
#define SLCD_ACMCFG_MODE_SEQ                  (SLCD_ACMCFG_MODE_SEQ_Val << SLCD_ACMCFG_MODE_Pos)   /**< (SLCD_ACMCFG) Sequential Display Mode Position  */
#define SLCD_ACMCFG_MODE_SCROLL               (SLCD_ACMCFG_MODE_SCROLL_Val << SLCD_ACMCFG_MODE_Pos) /**< (SLCD_ACMCFG) Scrolling Display Mode Position  */
#define SLCD_ACMCFG_STSEG_Pos                 _U_(24)                                              /**< (SLCD_ACMCFG) Start SEG Line Position */
#define SLCD_ACMCFG_STSEG_Msk                 (_U_(0x3F) << SLCD_ACMCFG_STSEG_Pos)                 /**< (SLCD_ACMCFG) Start SEG Line Mask */
#define SLCD_ACMCFG_STSEG(value)              (SLCD_ACMCFG_STSEG_Msk & ((value) << SLCD_ACMCFG_STSEG_Pos))
#define SLCD_ACMCFG_FCS_Pos                   _U_(30)                                              /**< (SLCD_ACMCFG) Frame Counter Selection Position */
#define SLCD_ACMCFG_FCS_Msk                   (_U_(0x3) << SLCD_ACMCFG_FCS_Pos)                    /**< (SLCD_ACMCFG) Frame Counter Selection Mask */
#define SLCD_ACMCFG_FCS(value)                (SLCD_ACMCFG_FCS_Msk & ((value) << SLCD_ACMCFG_FCS_Pos))
#define   SLCD_ACMCFG_FCS_FC0_Val             _U_(0x0)                                             /**< (SLCD_ACMCFG) Frame Counter 0  */
#define   SLCD_ACMCFG_FCS_FC1_Val             _U_(0x1)                                             /**< (SLCD_ACMCFG) Frame Counter 1  */
#define   SLCD_ACMCFG_FCS_FC2_Val             _U_(0x2)                                             /**< (SLCD_ACMCFG) Frame Counter 2  */
#define SLCD_ACMCFG_FCS_FC0                   (SLCD_ACMCFG_FCS_FC0_Val << SLCD_ACMCFG_FCS_Pos)     /**< (SLCD_ACMCFG) Frame Counter 0 Position  */
#define SLCD_ACMCFG_FCS_FC1                   (SLCD_ACMCFG_FCS_FC1_Val << SLCD_ACMCFG_FCS_Pos)     /**< (SLCD_ACMCFG) Frame Counter 1 Position  */
#define SLCD_ACMCFG_FCS_FC2                   (SLCD_ACMCFG_FCS_FC2_Val << SLCD_ACMCFG_FCS_Pos)     /**< (SLCD_ACMCFG) Frame Counter 2 Position  */
#define SLCD_ACMCFG_Msk                       _U_(0xFFBFFFF7)                                      /**< (SLCD_ACMCFG) Register Mask  */


/* -------- SLCD_ABMCFG : (SLCD Offset: 0x78) (R/W 8) Automated Bit Mapping Configuration -------- */
#define SLCD_ABMCFG_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_ABMCFG) Automated Bit Mapping Configuration  Reset Value */

#define SLCD_ABMCFG_FCS_Pos                   _U_(0)                                               /**< (SLCD_ABMCFG) Frame Counter Selection Position */
#define SLCD_ABMCFG_FCS_Msk                   (_U_(0x3) << SLCD_ABMCFG_FCS_Pos)                    /**< (SLCD_ABMCFG) Frame Counter Selection Mask */
#define SLCD_ABMCFG_FCS(value)                (SLCD_ABMCFG_FCS_Msk & ((value) << SLCD_ABMCFG_FCS_Pos))
#define   SLCD_ABMCFG_FCS_FC0_Val             _U_(0x0)                                             /**< (SLCD_ABMCFG) Frame Counter 0  */
#define   SLCD_ABMCFG_FCS_FC1_Val             _U_(0x1)                                             /**< (SLCD_ABMCFG) Frame Counter 1  */
#define   SLCD_ABMCFG_FCS_FC2_Val             _U_(0x2)                                             /**< (SLCD_ABMCFG) Frame Counter 2  */
#define SLCD_ABMCFG_FCS_FC0                   (SLCD_ABMCFG_FCS_FC0_Val << SLCD_ABMCFG_FCS_Pos)     /**< (SLCD_ABMCFG) Frame Counter 0 Position  */
#define SLCD_ABMCFG_FCS_FC1                   (SLCD_ABMCFG_FCS_FC1_Val << SLCD_ABMCFG_FCS_Pos)     /**< (SLCD_ABMCFG) Frame Counter 1 Position  */
#define SLCD_ABMCFG_FCS_FC2                   (SLCD_ABMCFG_FCS_FC2_Val << SLCD_ABMCFG_FCS_Pos)     /**< (SLCD_ABMCFG) Frame Counter 2 Position  */
#define SLCD_ABMCFG_SIZE_Pos                  _U_(2)                                               /**< (SLCD_ABMCFG) Size Position */
#define SLCD_ABMCFG_SIZE_Msk                  (_U_(0x3F) << SLCD_ABMCFG_SIZE_Pos)                  /**< (SLCD_ABMCFG) Size Mask */
#define SLCD_ABMCFG_SIZE(value)               (SLCD_ABMCFG_SIZE_Msk & ((value) << SLCD_ABMCFG_SIZE_Pos))
#define SLCD_ABMCFG_Msk                       _U_(0xFF)                                            /**< (SLCD_ABMCFG) Register Mask  */


/* -------- SLCD_CMDATA : (SLCD Offset: 0x7C) ( /W 32) Character Mapping Segments Data -------- */
#define SLCD_CMDATA_RESETVALUE                _U_(0x00)                                            /**<  (SLCD_CMDATA) Character Mapping Segments Data  Reset Value */

#define SLCD_CMDATA_SDATA_Pos                 _U_(0)                                               /**< (SLCD_CMDATA) Segments Data Position */
#define SLCD_CMDATA_SDATA_Msk                 (_U_(0xFFFFFF) << SLCD_CMDATA_SDATA_Pos)             /**< (SLCD_CMDATA) Segments Data Mask */
#define SLCD_CMDATA_SDATA(value)              (SLCD_CMDATA_SDATA_Msk & ((value) << SLCD_CMDATA_SDATA_Pos))
#define SLCD_CMDATA_Msk                       _U_(0x00FFFFFF)                                      /**< (SLCD_CMDATA) Register Mask  */


/* -------- SLCD_CMDMASK : (SLCD Offset: 0x80) (R/W 32) Character Mapping Segments Data Mask -------- */
#define SLCD_CMDMASK_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_CMDMASK) Character Mapping Segments Data Mask  Reset Value */

#define SLCD_CMDMASK_SDMASK_Pos               _U_(0)                                               /**< (SLCD_CMDMASK) Segments Data Mask Position */
#define SLCD_CMDMASK_SDMASK_Msk               (_U_(0xFFFFFF) << SLCD_CMDMASK_SDMASK_Pos)           /**< (SLCD_CMDMASK) Segments Data Mask Mask */
#define SLCD_CMDMASK_SDMASK(value)            (SLCD_CMDMASK_SDMASK_Msk & ((value) << SLCD_CMDMASK_SDMASK_Pos))
#define SLCD_CMDMASK_Msk                      _U_(0x00FFFFFF)                                      /**< (SLCD_CMDMASK) Register Mask  */


/* -------- SLCD_CMINDEX : (SLCD Offset: 0x84) (R/W 16) Character Mapping SEG/COM Index -------- */
#define SLCD_CMINDEX_RESETVALUE               _U_(0x00)                                            /**<  (SLCD_CMINDEX) Character Mapping SEG/COM Index  Reset Value */

#define SLCD_CMINDEX_SINDEX_Pos               _U_(0)                                               /**< (SLCD_CMINDEX) SEG Line Index Position */
#define SLCD_CMINDEX_SINDEX_Msk               (_U_(0x3F) << SLCD_CMINDEX_SINDEX_Pos)               /**< (SLCD_CMINDEX) SEG Line Index Mask */
#define SLCD_CMINDEX_SINDEX(value)            (SLCD_CMINDEX_SINDEX_Msk & ((value) << SLCD_CMINDEX_SINDEX_Pos))
#define SLCD_CMINDEX_CINDEX_Pos               _U_(8)                                               /**< (SLCD_CMINDEX) COM Line Index Position */
#define SLCD_CMINDEX_CINDEX_Msk               (_U_(0x7) << SLCD_CMINDEX_CINDEX_Pos)                /**< (SLCD_CMINDEX) COM Line Index Mask */
#define SLCD_CMINDEX_CINDEX(value)            (SLCD_CMINDEX_CINDEX_Msk & ((value) << SLCD_CMINDEX_CINDEX_Pos))
#define SLCD_CMINDEX_Msk                      _U_(0x073F)                                          /**< (SLCD_CMINDEX) Register Mask  */


