virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/slcd.h
/** \brief SLCD register offsets definitions */
#define SLCD_CTRLA_REG_OFST            (0x00)              /**< (SLCD_CTRLA) Control A Offset */
#define SLCD_CTRLB_REG_OFST            (0x04)              /**< (SLCD_CTRLB) Control B Offset */
#define SLCD_CTRLC_REG_OFST            (0x06)              /**< (SLCD_CTRLC) Control C Offset */
#define SLCD_CTRLD_REG_OFST            (0x08)              /**< (SLCD_CTRLD) Control D Offset */
#define SLCD_EVCTRL_REG_OFST           (0x0C)              /**< (SLCD_EVCTRL) Event Control Offset */
#define SLCD_INTENCLR_REG_OFST         (0x0D)              /**< (SLCD_INTENCLR) Interrupt Enable Clear Offset */
#define SLCD_INTENSET_REG_OFST         (0x0E)              /**< (SLCD_INTENSET) Interrupt Enable Set Offset */
#define SLCD_INTFLAG_REG_OFST          (0x0F)              /**< (SLCD_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SLCD_STATUS_REG_OFST           (0x10)              /**< (SLCD_STATUS) Status Offset */
#define SLCD_SYNCBUSY_REG_OFST         (0x14)              /**< (SLCD_SYNCBUSY) Synchronization Busy Offset */
#define SLCD_FC0_REG_OFST              (0x18)              /**< (SLCD_FC0) Frame Counter 0 Configuration Offset */
#define SLCD_FC1_REG_OFST              (0x19)              /**< (SLCD_FC1) Frame Counter 1 Configuration Offset */
#define SLCD_FC2_REG_OFST              (0x1A)              /**< (SLCD_FC2) Frame Counter 2 Configuration Offset */
#define SLCD_LPENL_REG_OFST            (0x1C)              /**< (SLCD_LPENL) LCD Pin Enable Low Offset */
#define SLCD_LPENH_REG_OFST            (0x20)              /**< (SLCD_LPENH) LCD Pin Enable High Offset */
#define SLCD_SDATAL0_REG_OFST          (0x24)              /**< (SLCD_SDATAL0) Segments Data Low for COM0 Line Offset */
#define SLCD_SDATAH0_REG_OFST          (0x28)              /**< (SLCD_SDATAH0) Segments Data High for COM0 Line Offset */
#define SLCD_SDATAL1_REG_OFST          (0x2C)              /**< (SLCD_SDATAL1) Segments Data Low for COM1 Line Offset */
#define SLCD_SDATAH1_REG_OFST          (0x30)              /**< (SLCD_SDATAH1) Segments Data High for COM1 Line Offset */
#define SLCD_SDATAL2_REG_OFST          (0x34)              /**< (SLCD_SDATAL2) Segments Data Low for COM2 Line Offset */
#define SLCD_SDATAH2_REG_OFST          (0x38)              /**< (SLCD_SDATAH2) Segments Data High for COM2 Line Offset */
#define SLCD_SDATAL3_REG_OFST          (0x3C)              /**< (SLCD_SDATAL3) Segments Data Low for COM3 Line Offset */
#define SLCD_SDATAH3_REG_OFST          (0x40)              /**< (SLCD_SDATAH3) Segments Data High for COM3 Line Offset */
#define SLCD_SDATAL4_REG_OFST          (0x44)              /**< (SLCD_SDATAL4) Segments Data Low for COM4 Line Offset */
#define SLCD_SDATAH4_REG_OFST          (0x48)              /**< (SLCD_SDATAH4) Segments Data High for COM4 Line Offset */
#define SLCD_SDATAL5_REG_OFST          (0x4C)              /**< (SLCD_SDATAL5) Segments Data Low for COM5 Line Offset */
#define SLCD_SDATAH5_REG_OFST          (0x50)              /**< (SLCD_SDATAH5) Segments Data High for COM5 Line Offset */
#define SLCD_SDATAL6_REG_OFST          (0x54)              /**< (SLCD_SDATAL6) Segments Data Low for COM6 Line Offset */
#define SLCD_SDATAH6_REG_OFST          (0x58)              /**< (SLCD_SDATAH6) Segments Data High for COM6 Line Offset */
#define SLCD_SDATAL7_REG_OFST          (0x5C)              /**< (SLCD_SDATAL7) Segments Data Low for COM7 Line Offset */
#define SLCD_SDATAH7_REG_OFST          (0x60)              /**< (SLCD_SDATAH7) Segments Data High for COM7 Line Offset */
#define SLCD_ISDATA_REG_OFST           (0x64)              /**< (SLCD_ISDATA) Indirect Segments Data Access Offset */
#define SLCD_BCFG_REG_OFST             (0x68)              /**< (SLCD_BCFG) Blink Configuration Offset */
#define SLCD_CSRCFG_REG_OFST           (0x6C)              /**< (SLCD_CSRCFG) Circular Shift Register Configuration Offset */
#define SLCD_CMCFG_REG_OFST            (0x70)              /**< (SLCD_CMCFG) Character Mapping Configuration Offset */
#define SLCD_ACMCFG_REG_OFST           (0x74)              /**< (SLCD_ACMCFG) Automated Character Mapping Configuration Offset */
#define SLCD_ABMCFG_REG_OFST           (0x78)              /**< (SLCD_ABMCFG) Automated Bit Mapping Configuration Offset */
#define SLCD_CMDATA_REG_OFST           (0x7C)              /**< (SLCD_CMDATA) Character Mapping Segments Data Offset */
#define SLCD_CMDMASK_REG_OFST          (0x80)              /**< (SLCD_CMDMASK) Character Mapping Segments Data Mask Offset */
#define SLCD_CMINDEX_REG_OFST          (0x84)              /**< (SLCD_CMINDEX) Character Mapping SEG/COM Index Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SLCD register API structure */
typedef struct
{  /* Segment Liquid Crystal Display Controller */
  __IO  uint32_t                       SLCD_CTRLA;         /**< Offset: 0x00 (R/W  32) Control A */
  __IO  uint16_t                       SLCD_CTRLB;         /**< Offset: 0x04 (R/W  16) Control B */
  __IO  uint16_t                       SLCD_CTRLC;         /**< Offset: 0x06 (R/W  16) Control C */
  __IO  uint8_t                        SLCD_CTRLD;         /**< Offset: 0x08 (R/W  8) Control D */
  __I   uint8_t                        Reserved1[0x03];
  __IO  uint8_t                        SLCD_EVCTRL;        /**< Offset: 0x0C (R/W  8) Event Control */
  __IO  uint8_t                        SLCD_INTENCLR;      /**< Offset: 0x0D (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        SLCD_INTENSET;      /**< Offset: 0x0E (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        SLCD_INTFLAG;       /**< Offset: 0x0F (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        SLCD_STATUS;        /**< Offset: 0x10 (R/   8) Status */
  __I   uint8_t                        Reserved2[0x03];
  __I   uint32_t                       SLCD_SYNCBUSY;      /**< Offset: 0x14 (R/   32) Synchronization Busy */
  __IO  uint8_t                        SLCD_FC0;           /**< Offset: 0x18 (R/W  8) Frame Counter 0 Configuration */
  __IO  uint8_t                        SLCD_FC1;           /**< Offset: 0x19 (R/W  8) Frame Counter 1 Configuration */
  __IO  uint8_t                        SLCD_FC2;           /**< Offset: 0x1A (R/W  8) Frame Counter 2 Configuration */
  __I   uint8_t                        Reserved3[0x01];
  __IO  uint32_t                       SLCD_LPENL;         /**< Offset: 0x1C (R/W  32) LCD Pin Enable Low */
  __IO  uint32_t                       SLCD_LPENH;         /**< Offset: 0x20 (R/W  32) LCD Pin Enable High */
  __IO  uint32_t                       SLCD_SDATAL0;       /**< Offset: 0x24 (R/W  32) Segments Data Low for COM0 Line */
  __IO  uint32_t                       SLCD_SDATAH0;       /**< Offset: 0x28 (R/W  32) Segments Data High for COM0 Line */
  __IO  uint32_t                       SLCD_SDATAL1;       /**< Offset: 0x2C (R/W  32) Segments Data Low for COM1 Line */
  __IO  uint32_t                       SLCD_SDATAH1;       /**< Offset: 0x30 (R/W  32) Segments Data High for COM1 Line */
  __IO  uint32_t                       SLCD_SDATAL2;       /**< Offset: 0x34 (R/W  32) Segments Data Low for COM2 Line */
  __IO  uint32_t                       SLCD_SDATAH2;       /**< Offset: 0x38 (R/W  32) Segments Data High for COM2 Line */
  __IO  uint32_t                       SLCD_SDATAL3;       /**< Offset: 0x3C (R/W  32) Segments Data Low for COM3 Line */
  __IO  uint32_t                       SLCD_SDATAH3;       /**< Offset: 0x40 (R/W  32) Segments Data High for COM3 Line */
  __IO  uint32_t                       SLCD_SDATAL4;       /**< Offset: 0x44 (R/W  32) Segments Data Low for COM4 Line */
  __IO  uint32_t                       SLCD_SDATAH4;       /**< Offset: 0x48 (R/W  32) Segments Data High for COM4 Line */
  __IO  uint32_t                       SLCD_SDATAL5;       /**< Offset: 0x4C (R/W  32) Segments Data Low for COM5 Line */
  __IO  uint32_t                       SLCD_SDATAH5;       /**< Offset: 0x50 (R/W  32) Segments Data High for COM5 Line */
  __IO  uint32_t                       SLCD_SDATAL6;       /**< Offset: 0x54 (R/W  32) Segments Data Low for COM6 Line */
  __IO  uint32_t                       SLCD_SDATAH6;       /**< Offset: 0x58 (R/W  32) Segments Data High for COM6 Line */
  __IO  uint32_t                       SLCD_SDATAL7;       /**< Offset: 0x5C (R/W  32) Segments Data Low for COM7 Line */
  __IO  uint32_t                       SLCD_SDATAH7;       /**< Offset: 0x60 (R/W  32) Segments Data High for COM7 Line */
  __O   uint32_t                       SLCD_ISDATA;        /**< Offset: 0x64 ( /W  32) Indirect Segments Data Access */
  __IO  uint32_t                       SLCD_BCFG;          /**< Offset: 0x68 (R/W  32) Blink Configuration */
  __IO  uint32_t                       SLCD_CSRCFG;        /**< Offset: 0x6C (R/W  32) Circular Shift Register Configuration */
  __IO  uint8_t                        SLCD_CMCFG;         /**< Offset: 0x70 (R/W  8) Character Mapping Configuration */
  __I   uint8_t                        Reserved4[0x03];
  __IO  uint32_t                       SLCD_ACMCFG;        /**< Offset: 0x74 (R/W  32) Automated Character Mapping Configuration */
  __IO  uint8_t                        SLCD_ABMCFG;        /**< Offset: 0x78 (R/W  8) Automated Bit Mapping Configuration */
  __I   uint8_t                        Reserved5[0x03];
  __O   uint32_t                       SLCD_CMDATA;        /**< Offset: 0x7C ( /W  32) Character Mapping Segments Data */
  __IO  uint32_t                       SLCD_CMDMASK;       /**< Offset: 0x80 (R/W  32) Character Mapping Segments Data Mask */
  __IO  uint16_t                       SLCD_CMINDEX;       /**< Offset: 0x84 (R/W  16) Character Mapping SEG/COM Index */
} slcd_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML22_SLCD_COMPONENT_H_ */
